app/Controllers/penilaian/Penilaian.php

SELECT *
FROM `sarbis`
WHERE `user_nip` = '20220201950'
AND `tahun_sarbis` = 2021
---
                $cekSarbis = new SarbisModel();
                $current_date = date('Y');
                $sarbis_date = (int)$current_date - 1;
                if ($cekSarbis->where([
                    'user_nip' => session()->get('fnip'),
                    'tahun_sarbis' => $sarbis_date
                ])->get()->getRowArray() == 0) {

SELECT *
FROM `sarbis`
WHERE `user_nip` = '20220201950'
AND `tahun_sarbis` = 2021
---
                    return redirect()->to(base_url('sarbis/entri'));
                } else {
                    //MARK: Ambil Data Sasaran Bisnis
                    $data['getSarbis'] = $cekSarbis->where([
                        'user_nip' => session()->get('fnip'),
                        'tahun_sarbis' => $sarbis_date
                    ])->get()->getRowArray();