app/Models/Coaching/CoachingModel.php

SELECT *
FROM `coaching`
WHERE `fnip_karyawan` = '20190601620'
AND `status` = 0
---
    public function getPendingCoaching($nip)
    {
        $query = $this->where('fnip_karyawan', $nip)->where('status', 0)->get()->getResultArray();