app/Models/Karyawan/AtasanModel.php

SELECT `user_nip`
FROM `atasan`
WHERE `atasan_nip` = '20190601620'
SELECT `pekerja`.`fnip`, `pekerja`.`fnama`, `pekerja`.`jabatan`
FROM `atasan`
LEFT JOIN `auth` ON `auth`.`userid` = `atasan`.`user_nip`
LEFT JOIN `pekerja` ON `pekerja`.`fnip` = `atasan`.`user_nip`
WHERE `auth`.`is_active` = 1
AND  `pekerja`.`jabatan` NOT LIKE '%PENGURUS BCA SYARIAH%' ESCAPE '!'
AND `pekerja`.`fnip` IN ('20190401601','20190401602','20210401779','20211101899')
---
    public function getBawahanWajibCoaching($table_for_join = 'pekerja')
    {
        $listBawahan = $this->select('user_nip')->where('atasan_nip', session()->get('fnip'))->findAll();
        $first_elements = array_map(function ($i) {
            return $i['user_nip'];
        }, $listBawahan);

        $builder = $this->table($this->table);
        $builder->select("$table_for_join.fnip, $table_for_join.fnama, $table_for_join.jabatan")->join('auth', "auth.userid = $this->table.user_nip", 'left')->where('auth.is_active', 1)->notLike("$table_for_join.jabatan", "PENGURUS BCA SYARIAH");
        $builder->join($table_for_join, "$table_for_join.fnip = $this->table.user_nip", 'left')->whereIn("$table_for_join.fnip", $first_elements);
        $query = $builder->get()->getResultArray();

SELECT `atasan`.`user_nip`, `a`.`is_active`, `a`.`status`
FROM `atasan`
JOIN `auth` as `a` ON `atasan`.`user_nip`=`a`.`userid`
WHERE `atasan_nip` = '20190601620'
AND `a`.`status` != "resign"
SELECT `pekerja`.*, `auth`.`is_blocked`
FROM `atasan`
LEFT JOIN `auth` ON `auth`.`userid` = `atasan`.`user_nip`
LEFT JOIN `pekerja` ON `pekerja`.`fnip` = `atasan`.`user_nip`
WHERE `auth`.`is_active` = 1
AND `pekerja`.`fnip` IN ('20190401601','20190401602','20210401779','20211101899')
---
    public function getBawahanFull($table_for_join = 'pekerja')
    {
        $listBawahan = $this->select('atasan.user_nip, a.is_active, a.status')->join('auth as a', 'atasan.user_nip=a.userid')->where('atasan_nip', session()->get('fnip'))->where('a.status != "resign" ')->findAll();
        $first_elements = array_map(function ($i) {
            return $i['user_nip'];
        }, $listBawahan);
        try {
            $builder = $this->table($this->table)->select("$table_for_join.*, auth.is_blocked")->join('auth', "auth.userid = $this->table.user_nip", 'left')->join($table_for_join, "$table_for_join.fnip = $this->table.user_nip", 'left')->where('auth.is_active', 1)->whereIn("$table_for_join.fnip", $first_elements);
            $query = $builder->get()->getResultArray();