app/Controllers/Home.php

SELECT `fnip_karyawan` as `fnip`
FROM `coaching`
WHERE `fnip_atasan` = '20190601620'
AND `tanggal_coaching` BETWEEN '2022-01-01' AND '2022-06-30'
---
                                if ($coachingPeriode->periode_1) {
                                        $data['current_period'] = 1;
                                        $thisYear = date("Y");
                                        $coachingSemester1 = $modelCoaching->select("fnip_karyawan as fnip")->where("fnip_atasan", $nip)->where("tanggal_coaching BETWEEN '$thisYear-01-01' AND '$thisYear-06-30'")->get()->getResultArray();

SELECT `fnip`, `fnama`
FROM `pekerja`
WHERE `fnip` IN ('20190401601','20190401602','20210401779','20211101899')
---
                                // $getData = $PekerjaModel->select("fnip, fnama")->whereIn("fnip", $belumCoachingSemester1)->get()->getResultArray();
                                // $this->coachingQueue1 = $getData;
                                try {
                                        $getData = $PekerjaModel->select("fnip, fnama")->whereIn("fnip", $belumCoachingSemester1)->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `pekerja`
WHERE `jabatan` != 'PENGURUS BCA SYARIAH'
---
                $sarbisModel = new SarbisModel();

                //MARK: FOR WIDGET
                $data['count_all_pekerja']      = $pekerjaModel->where('jabatan !=', 'PENGURUS BCA SYARIAH')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `auth`
WHERE `is_active` = 1
AND `is_blocked` != 1
SELECT COUNT(*) AS `numrows`
FROM `auth`
WHERE `is_active` = 0
SELECT COUNT(*) AS `numrows`
FROM `auth`
WHERE `is_blocked` = 1
AND `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `pekerja`
WHERE `satuan_kerja` = 'SATUAN KERJA TI DAN LOGISTIK'
SELECT COUNT(*) AS `numrows`
FROM `pekerja`
WHERE `satuan_kerja` = 'SATUAN KERJA AUDIT INTERNAL'
SELECT COUNT(*) AS `numrows`
FROM `pekerja`
WHERE `satuan_kerja` = 'SATUAN KERJA HUKUM DAN SDM'
SELECT COUNT(*) AS `numrows`
FROM `pekerja`
WHERE `satuan_kerja` = 'SATUAN KERJA BISNIS DAN KOMUNIKASI'
SELECT COUNT(*) AS `numrows`
FROM `pekerja`
WHERE `satuan_kerja` = 'SATUAN KERJA ANALISA RISIKO PEMBIAYAAN'
SELECT COUNT(*) AS `numrows`
FROM `pekerja`
WHERE `satuan_kerja` = 'SATUAN KERJA KEUANGAN DAN PERENCANAAN PERUSAHAAN'
SELECT COUNT(*) AS `numrows`
FROM `pekerja`
WHERE `satuan_kerja` = 'MANAJEMEN RISIKO'
SELECT COUNT(*) AS `numrows`
FROM `pekerja`
WHERE `satuan_kerja` = 'DIVISI OPERASI'
SELECT COUNT(*) AS `numrows`
FROM `pekerja`
WHERE `satuan_kerja` = 'KEPATUHAN'
---
                }

                $data['count_pa']               = $otorisasiModel->countAllData();
                $data['activeUser']             = $authModel->where('is_active', 1)->where('is_blocked != 1')->countAllResults();
                $data['nonactiveUser']          = $authModel->where('is_active', 0)->countAllResults();
                $data['blockUser']              = $authModel->where('is_blocked', 1)->where('is_active', 1)->countAllResults();


                //MARK: FOR CHART
                $data['count_stl']  = $pekerjaModel->where('satuan_kerja', 'SATUAN KERJA TI DAN LOGISTIK')->countAllResults();
                $data['count_sai']  = $pekerjaModel->where('satuan_kerja', 'SATUAN KERJA AUDIT INTERNAL')->countAllResults();
                $data['count_hsd']  = $pekerjaModel->where('satuan_kerja', 'SATUAN KERJA HUKUM DAN SDM')->countAllResults();
                $data['count_sbk']  = $pekerjaModel->where('satuan_kerja', 'SATUAN KERJA BISNIS DAN KOMUNIKASI')->countAllResults();
                $data['count_arp']  = $pekerjaModel->where('satuan_kerja', 'SATUAN KERJA ANALISA RISIKO PEMBIAYAAN')->countAllResults();
                $data['count_ska']  = $pekerjaModel->where('satuan_kerja', 'SATUAN KERJA KEUANGAN DAN PERENCANAAN PERUSAHAAN')->countAllResults();
                $data['count_mrk']  = $pekerjaModel->where('satuan_kerja', 'MANAJEMEN RISIKO')->countAllResults();
                $data['count_dop']  = $pekerjaModel->where('satuan_kerja', 'DIVISI OPERASI')->countAllResults();
                $data['count_kep']  = $pekerjaModel->where('satuan_kerja', 'KEPATUHAN')->countAllResults();

SELECT *
FROM `pekerja`
WHERE `fnip` = '20190601620'
---
                //MARK: FOR EMPLOYEE DASHBOARD

                $pekerjaModel       = new PekerjaModel();
                $data['pekerja']    = $pekerjaModel->where('fnip', session()->get('fnip'))->get()->getRowArray();

SELECT *
FROM `coaching`
WHERE `fnip_atasan` = '20190601620'
AND  `tanggal_coaching` LIKE '%2022%' ESCAPE '!'
---
                $otorisasiModel         = new OtorisasiModel();
                if (session()->role == '3') {
                        $data['countEmployee']  = count($atasanModel->getBawahanFull());
                        $data['countCoaching']  = count($coachingModel->where('fnip_atasan', session()->get('fnip'))->like('tanggal_coaching', date('Y'))->get()->getResultArray());

SELECT `sarbis`.*, `pekerja`.`fnama`, `pekerja`.`jabatan`, `pekerja`.`departemen`, `pekerja`.`satuan_kerja`, `pekerja`.`bidang`, `pekerja`.`fungsi`
FROM `sarbis`
JOIN `pekerja` ON `pekerja`.`fnip` = `sarbis`.`user_nip`
WHERE atasan1='20190601620'OR atasan2 = '20190601620'
---
                        $where = "atasan1='" . session()->get('fnip') . "'OR atasan2='" . session()->get('fnip') . "'";
                        $sarbisModel->select("sarbis.*, pekerja.fnama, pekerja.jabatan, pekerja.departemen, pekerja.satuan_kerja, pekerja.bidang, pekerja.fungsi");
                        $sarbisModel->join("pekerja", "pekerja.fnip = sarbis.user_nip");
                        $data['countOtoSarbis'] = count($sarbisModel->where($where)->get()->getResultArray());